erpdev.СХК_Расширение/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5b57481-c7d7-459c-8f38-003976928dcf">
  <name>РасходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="08a6fc5b-ac14-420f-987d-169c39288bf4">
    <name>ЗаданиеНаПеревозку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b4c013e1-f51f-4900-840f-f755e500fa76">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="07d94e4d-722d-4939-a3da-ba2a3afba256">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="145a504e-53c5-4349-a710-b106ea052174">
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89cd1a11-c961-49a0-b7ea-67cc67387e68">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63f1d0df-8450-40b2-a6bf-26e9a9bc348d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="00a21d2c-dfa9-40aa-938f-3fe890533f41">
    <name>ПорядокДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="96ee5655-e55c-4d9d-9386-a82e47bcd733">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5fb4b5c4-30c2-4b89-82ff-7057477218df">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1e82bc85-5efe-473f-a2a6-04b053896ef5">
    <name>ЗонаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6a9f8399-4614-4cb5-ba80-210c90c11e54">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="49f3e5fd-cf9c-4585-8222-c47ae930e2dd">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5d8985e0-1a5e-4908-ba86-c4b692cd1634">
    <name>Контролер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="47e1733e-b075-4282-944c-d07d96cd86a9">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8ee7ff7a-ec43-4840-800d-22245c14dc90">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="f93cbc89-602b-4c37-a90c-1bceda80afe7">
    <name>ТоварыПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="07df2cb8-3a48-4671-b17f-d2bf82e412f8">
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="83f29f84-a577-47ce-933a-46184309914f">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СХК_НомерПалета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="83b872e0-168f-4cbc-b791-68c2edf79de4">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cd7cf0b2-0078-4dfa-b137-5418e69d7024">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8e2e117e-50d4-46cf-9e08-ea6f475d1cca">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ae04c7e3-73f4-4a07-bef6-baf69fcb4dfc">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="389dae2c-5f04-4c10-8555-7103bd0c3f21">
    <name>ОтгружаемыеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0185ac19-4e81-475e-842b-4f1cec88f0d3">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="323f8573-378e-4fef-931a-b93c2c113890">
      <name>УпаковочныйЛистРодитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c4e6782d-54b8-4614-8549-b94f2af33d1b">
      <name>Действие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="26cd1a83-599c-4cb2-88f4-8da57cd2dfaf">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="152a5a3e-8c56-4983-9052-b8b75a6e0d12">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8666ee78-482b-4c09-9baa-791917648dbd">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b9cf586a-fbd5-4e5f-a0f7-df3ef40e11d2">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="93ae14aa-f407-4566-96ba-2cbba0eadcc2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fc35a8ee-3531-4b7e-8222-611bb0bc88ab">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="40dd6af6-2e66-4e56-b31e-687455807ff2">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/Enums/СтатусыРасходныхОрдеров/СтатусыРасходныхОрдеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d873fb7c-bffd-4ee5-9885-25af6032a41f">
  <name>СтатусыРасходныхОрдеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="bdc2dd3b-b02c-4815-af56-2538b334fbf4">
    <name>Отгружен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

erpdev.СХК_Расширение/src/Catalogs/ГруппыПользователей/ГруппыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="a2782760-dd4c-44d2-a785-814d6f610455">
  <name>ГруппыПользователей</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="6581ac1f-11ef-42b8-9f3b-590bb7546e63">
    <name>Состав</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ce952e88-35b7-4506-81ac-d7081e50a650">
      <name>Пользователь</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/Documents/РасходныйОрдерНаТовары/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция Расш1_ПроверкаСтатуса()
 	Возврат Объект.Статус <> Перечисления.СтатусыРасходныхОрдеров.Отгружен
КонецФункции

&НаКлиенте
Процедура Расш1_ПослеЗаписиПосле(ПараметрыЗаписи)
	Если  Расш1_ПроверкаСтатуса() Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,"Не забудьте установить статус Отгружен!",5,"Внимание!!!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Параметры) Экспорт	
КонецПроцедуры


&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)  
	
КонецПроцедуры 

&НаСервере
Процедура ДоступностьРеквизитов()
	
	ТекПользователь = Пользователи.АвторизованныйПользователь(); 
	
	ГруппаСклад = Справочники.ГруппыПользователей.НайтиПоНаименованию("Отдел складского учета"); 
	
	Отбор = Новый Структура;
	Отбор.Вставить("Пользователь",ТекПользователь);
	Строка = ГруппаСклад.Состав.НайтиСтроки(Отбор);                               
	Если Строка.Количество()>=1 И ТИПЗнч(Объект.Получатель) = ТИП("СправочникСсылка.Партнеры") Тогда  
		//ЭтаФорма.Элементы.Статус.Доступность = Ложь;
		ЭтаФорма.Элементы.ОтгружаемыеТоварыДействие.ТолькоПросмотр = Истина; 
	ИначеЕсли Строка.Количество()>=1 И Объект.Получатель = Справочники.Склады.НайтиПоНаименованию("Склад списания") Тогда  
		ЭтаФорма.Элементы.Статус.Доступность = Ложь;
	КонецЕсли; 
	
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("СХК_ПолныеСклад") Тогда

	Иначе 
		//Если ТИПЗнч(Объект.Получатель) = ТИП("СправочникСсылка.Партнеры") Тогда
		//	ЭтаФорма.Элементы.ТоварыПоРаспоряжениямСерия.ТолькоПросмотр = Истина;
		//	ЭтаФорма.Элементы.ОтгружаемыеТоварыСерия.ТолькоПросмотр = Истина;
		//КонецЕсли;
	КонецЕсли;
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПеред(Отказ)
	ДоступностьРеквизитов();
КонецПроцедуры
